{
  "architectures": [
    "Llama4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_chunk_size": 32768,
  "attention_dropout": 0.0,
  "attn_scale": 0.1,
  "attn_temperature_tuning": false,
  "bos_token_id": 128000,
  "eos_token_id": [
    128001,
    128008,
    128009
  ],
  "floor_scale": 8192,
  "for_llm_compressor": false,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 576,
  "initializer_range": 0.02,
  "interleave_moe_layer_step": 0,
  "intermediate_size": 8192,
  "intermediate_size_mlp": 2048,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 32768,
  "model_type": "llama4_text",
  "moe_layers": [],
  "no_rope_layers": [
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1
  ],
  "num_attention_heads": 9,
  "num_experts_per_tok": 0,
  "num_hidden_layers": 15,
  "num_key_value_heads": 3,
  "num_local_experts": 0,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 8000000.0,
  "router_aux_loss_coef": 0.001,
  "router_jitter_noise": 0.0,
  "tie_word_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.0",
  "use_cache": true,
  "use_qk_norm": true,
  "vocab_size": 128256
}
